index=windows sourcetype=WinEventLog:Security EventCode=4625
| stats count AS failed_attempts by user
| where failed_attempts > 5
| sort - failed_attempts

// are multiple accounts being targeted?
// multiple fialures across users = brute-force or credential stuffing
// EventCode 4625 = failed login
