index=windows sourcetype=WinEventLog:Security
(EventCode=4625 OR EventCode=4624)
| stats count by EventCode, user, src_ip
| sort user, EventCode

// did the attacker succedd?
// EventCode 4624 = successful login
